src/Catalogs/ar_Агенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Агенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Пользователь</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_LLMПровайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_LLMПровайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_РежимАвтономии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_РежимАвтономии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Инструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИмяРоли1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_МаксШагов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_МаксДействий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_МаксСуммаДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_РасписаниеCron</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТокенИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИспользоватьСессии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПланироватьРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ar_ДоступныеИнструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Инструмент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Включен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ar_ПереопределенияПромпта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ar_ПодключённыеSkills</Name>
					<Comment>M:N-связь агента с реестром ar_Навыки (META-23). Содержимое подключённых и включённых skills инжектируется в STABLE-слой контекста (SKILL-02).</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Skill</Name>
							<Comment>Ссылка на элемент реестра ar_Навыки (META-23).</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ar_Навыки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Включен</Name>
							<Comment>Позволяет временно отключить подключённый skill без удаления строки ТЧ.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Порядок</Name>
							<Comment>Порядковый номер для детерминированной инжекции содержимого skills в STABLE-слой. Меньшее значение - раньше в конкатенации.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ar_ПравилаДоступаИнструментов</Name>
					<Comment>Вычисляемые правила доступа к реестру ar_Инструменты (SCALE-07): разрешающие и запрещающие правила по категории, пакету, namespace, конкретному инструменту или уровню риска. Запрещающие правила всегда побеждают разрешающие.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_ТипПравила</Name>
							<Comment>Измерение, по которому фильтруется реестр ar_Инструменты: Категория, Пакет, Namespace, Инструмент или RiskLevel.</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ar_ТипПравилаДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Значение</Name>
							<Comment>Значение критерия: код категории, UUID пакета (ar_ИдентификаторПакета), namespace-префикс, имя tool (ar_Имя) либо системное имя RiskLevel (Read/Draft/Write/Commit). Точное совпадение строки, без wildcard — пустая строка не совпадает ни с чем.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Разрешить</Name>
							<Comment>Истина = включает совпадающие tools в набор, Ложь = исключает. Запрещающие правила применяются последними и всегда побеждают разрешающие, независимо от ar_Порядок.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Порядок</Name>
							<Comment>Порядок применения разрешающих правил внутри своего знака (для читаемости и логики union разрешающих правил). Для запрещающих правил используется только для сортировки в UI, не влияет на приоритет — deny всегда побеждает.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ar_Пресеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Пресеты</Name>
			<Comment>Реестр готовых конфигураций агентов (пресетов) для импорта в ar_Агенты. META-22.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_JSON</Name>
					<Comment>Сериализованная конфигурация агента. Без ключей и идентификаторов провайдеров.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Категория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИконкаИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИсточникРасширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ar_ПресетыИмпорт/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// AgentRunner для 1С
//
// Лицензия: MIT. Полный текст — в файле LICENSE в корне репозитория.
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_ПресетыИмпорт. Импорт агента из пресета в ar_Агенты.
//
// Назначение: десериализация JSON пресета -> создание нового элемента
// Справочник.ar_Агенты. Не использует привилегированный режим.
//
// Два публичных входа с общим ядром (ИмпортироватьИзТекстаJSON):
//   - ИмпортироватьПресет(СсылкаПресет) - пресет из справочника ar_Пресеты
//     (ar_Пресеты.ar_JSON), пользовательские/marketplace-пресеты (UI-17).
//   - ИмпортироватьПресетИзТекста(ТекстJSON, ИмяFallback) - пресет из готового
//     текста JSON (например, макета встроенной обработки ar_ПресетыВстроенные,
//     см. ar_МастерНастройки шаг "Пресет") - без ссылки на справочник.
//
// Контракт JSON пресета (kind = "agent_preset", ar_preset_version = 1):
//   { "kind": "agent_preset", "ar_preset_version": 1, "description": "...",
//     "compatible_configs": ["universal"] | ["ИмяКонфигурации", ...] (опц.),
//     "agent": { "name", "instruction", "llm_provider_name", "model",
//                "temperature", "max_steps", "max_actions", "max_action_sum",
//                "autonomy_mode", "tools": [{"name","enabled","required"}],
//                "skills": [{"name"}] } }
//
// compatible_configs - опционален, по умолчанию ["universal"]; несовпадение
// с текущей конфигурацией (Метаданные.Имя) не блокирует импорт, только
// выставляет Результат.НесовместимаяКонфигурация = Истина.
// tools[].required (опц., по умолчанию Ложь) - если tool с этим флагом не
// найден, его имя дополнительно попадает в Результат.НеНайденыОбязательныеTools.
//
// SEC-TOOL-01: ЗАПРЕЩЕНО принимать из tools[] пресета ключ
// "code_implementation" (зарезервированное имя) с непустым значением -
// ВалидироватьСтруктуруПресета отклоняет такой пресет отказом
// "tool_code_import_forbidden" (не предупреждением). Любой будущий импорт
// tools (в этом модуле или в новом) обязан отклонять непустой
// ar_КодРеализации/эквивалент; режим «Код» справочника ar_Инструменты принимается
// ТОЛЬКО через ручной ввод в карточке администратором с полными правами.
// См. .docs/Модель-угроз-режим-Код.md.
//
// Свойства: Сервер, не клиент, не привилегированный.
// См. спеку: .docs/specs/UI-17.md, .docs/specs/SEC-TOOL-01.md
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Импортирует пресет из справочника ar_Пресеты в новый элемент ar_Агенты.
//
// Читает ar_Пресеты.ar_JSON по ссылке, делегирует в ИмпортироватьИзТекстаJSON.
//
// Параметры:
//   СсылкаПресет - СправочникСсылка.ar_Пресеты - ссылка на пресет.
//
// Возвращаемое значение:
//   Структура - см. ИмпортироватьИзТекстаJSON.
//
Функция ИмпортироватьПресет(Знач СсылкаПресет) Экспорт

	ТекстJSON = ПолучитьJSONПресета(СсылкаПресет);
	ИмяFallback = "";
	Если ЗначениеЗаполнено(СсылкаПресет) Тогда
		ИмяFallback = СсылкаПресет.ar_Имя;
	КонецЕсли;

	Возврат ИмпортироватьИзТекстаJSON(ТекстJSON, ИмяFallback);

КонецФункции

// Импортирует пресет из готового текста JSON (без ссылки на справочник
// ar_Пресеты) в новый элемент ar_Агенты - используется для встроенных
// пресетов, поставляемых как макеты обработки ar_ПресетыВстроенные.
//
// Параметры:
//   ТекстJSON             - Строка - сырой текст JSON пресета.
//   ИмяFallback           - Строка - имя агента, если в JSON нет agent.name.
//   СсылкаПровайдераОверрайд - СправочникСсылка.ar_LLMПровайдеры - если
//     заполнена, заменяет llm_provider_name/model из пресета провайдером
//     и его ar_DefaultModel (мастер настройки: агент должен работать на
//     провайдере, который пользователь настроил на шаге 3, а не на том,
//     что зашит в конкретном пресете).
//
// Возвращаемое значение:
//   Структура - см. ИмпортироватьИзТекстаJSON.
//
Функция ИмпортироватьПресетИзТекста(Знач ТекстJSON, Знач ИмяFallback = "",
	Знач СсылкаПровайдераОверрайд = Неопределено) Экспорт

	Возврат ИмпортироватьИзТекстаJSON(ТекстJSON, ИмяFallback, СсылкаПровайдераОверрайд);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Общее ядро импорта: десериализация, валидация, создание агента. Не
// пробрасывает исключений - все внутренние ошибки конвертируются в результат.
// Операция выполняется от имени текущего пользователя: при недостаточных
// правах запись завершится ошибкой => Успех = Ложь, Причина = "access_denied".
//
// Параметры:
//   ТекстJSON             - Строка - сырой текст JSON пресета.
//   ИмяFallback           - Строка - имя агента, если в JSON нет agent.name (не ссылка).
//   СсылкаПровайдераОверрайд - СправочникСсылка.ar_LLMПровайдеры - см.
//     ИмпортироватьПресетИзТекста; Неопределено = поведение не меняется
//     (провайдер/модель берутся из пресета, как раньше).
//
// Возвращаемое значение:
//   Структура - с ключами:
//     * Успех                     - Булево
//     * АгентСсылка               - СправочникСсылка.ar_Агенты (Неопределено при Успех=Ложь)
//     * НеНайденныеTools          - Массив строк (names не найденных tools)
//     * НеНайденыОбязательныеTools - Массив строк (подмножество НеНайденныеTools с required=true)
//     * НеНайденныеSkills         - Массив строк (names не найденных skills)
//     * НеНайденПровайдер         - Булево
//     * ИмяПровайдераПресет       - Строка (оригинальное имя из пресета, если не найден)
//     * НесовместимаяКонфигурация - Булево (compatible_configs не содержит текущую/"universal")
//     * Причина                   - Строка ("invalid_json","wrong_kind","unsupported_version",
//                                           "access_denied","error")
//
Функция ИмпортироватьИзТекстаJSON(Знач ТекстJSON, Знач ИмяFallback = "",
	Знач СсылкаПровайдераОверрайд = Неопределено)

	Результат = НовыйРезультатИмпорта();

	// 1. Проверяем, что текст непустой
	Если НЕ ЗначениеЗаполнено(ТекстJSON) Тогда
		Результат.Причина = "invalid_json";
		Возврат Результат;
	КонецЕсли;

	// 2. Десериализуем
	Данные = ar_JSON.ИзJSON(ТекстJSON);
	Если Данные = Неопределено Тогда
		Результат.Причина = "invalid_json";
		Возврат Результат;
	КонецЕсли;

	// 3. Валидируем структуру
	ОшибкаВалидации = ВалидироватьСтруктуруПресета(Данные);
	Если НЕ ПустаяСтрока(ОшибкаВалидации) Тогда
		Результат.Причина = ОшибкаВалидации;
		Возврат Результат;
	КонецЕсли;

	// 3а. Проверка совместимости конфигурации (не блокирует импорт)
	Результат.НесовместимаяКонфигурация = НЕ КонфигурацияСовместима(Данные);

	// 4. Извлекаем блок агента (уже проверен в валидаторе)
	БлокАгента = Данные.Получить("agent");

	// 5. Создаём нового агента в транзакции
	НачатьТранзакцию();
	Попытка
		НовыйАгент = Справочники.ar_Агенты.СоздатьЭлемент();
		ЗаполнитьАгентаИзПресета(НовыйАгент, БлокАгента, ИмяFallback, Результат, СсылкаПровайдераОверрайд);
		НовыйАгент.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Если СтрНайти(НРег(ТекстОшибки), "доступ") > 0
			Или СтрНайти(НРег(ТекстОшибки), "право") > 0
			Или СтрНайти(НРег(ТекстОшибки), "недостаточно") > 0 Тогда
			Результат.Причина = "access_denied";
		Иначе
			Результат.Причина = "error";
		КонецЕсли;
		ЗаписатьОшибкуВЖурнал(ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;

	Результат.АгентСсылка = НовыйАгент.Ссылка;
	Результат.Успех = Истина;

	Возврат Результат;

КонецФункции

// Проверяет совместимость пресета с текущей конфигурацией по полю
// compatible_configs (опционально; отсутствие трактуется как universal).
//
// Параметры:
//   Данные - Соответствие - разобранный JSON пресета (корень).
//
// Возвращаемое значение:
//   Булево - Истина, если пресет универсален или совместим с текущей конфигурацией.
//
Функция КонфигурацияСовместима(Знач Данные)

	СписокКонфигураций = Данные.Получить("compatible_configs");
	Если ТипЗнч(СписокКонфигураций) <> Тип("Массив") Или СписокКонфигураций.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	ИмяТекущейКонфигурации = НРег(Метаданные.Имя);

	Для Каждого Элемент Из СписокКонфигураций Цикл
		Если ТипЗнч(Элемент) <> Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		Если НРег(Элемент) = "universal" Или НРег(Элемент) = ИмяТекущейКонфигурации Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Создаёт заготовку результата импорта с пустыми полями.
//
// Возвращаемое значение:
//   Структура
//
Функция НовыйРезультатИмпорта()

	Рез = Новый Структура;
	Рез.Вставить("Успех", Ложь);
	Рез.Вставить("АгентСсылка", Неопределено);
	Рез.Вставить("НеНайденныеTools", Новый Массив);
	Рез.Вставить("НеНайденыОбязательныеTools", Новый Массив);
	Рез.Вставить("НеНайденныеSkills", Новый Массив);
	Рез.Вставить("НеНайденПровайдер", Ложь);
	Рез.Вставить("ИмяПровайдераПресет", "");
	Рез.Вставить("НесовместимаяКонфигурация", Ложь);
	Рез.Вставить("Причина", "");
	Возврат Рез;

КонецФункции

// Получает строку JSON из поля ar_JSON пресета по ссылке.
//
// Параметры:
//   СсылкаПресет - СправочникСсылка.ar_Пресеты
//
// Возвращаемое значение:
//   Строка - содержимое поля ar_JSON или "" если не найден.
//
Функция ПолучитьJSONПресета(Знач СсылкаПресет)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ar_Пресеты.ar_JSON КАК JSON
	|ИЗ
	|	Справочник.ar_Пресеты КАК ar_Пресеты
	|ГДЕ
	|	ar_Пресеты.Ссылка = &Ссылка
	|	И ar_Пресеты.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Ссылка", СсылкаПресет);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.JSON;
	КонецЕсли;

	Возврат "";

КонецФункции

// Проверяет структуру JSON-пресета на корректность.
//
// Параметры:
//   Данные - Соответствие - разобранный JSON
//
// Возвращаемое значение:
//   Строка - код ошибки или "" если всё ОК.
//
Функция ВалидироватьСтруктуруПресета(Знач Данные)

	Если ТипЗнч(Данные) <> Тип("Соответствие") Тогда
		Возврат "invalid_json";
	КонецЕсли;

	// Проверяем наличие и значение ключа kind
	КлючKind = Данные.Получить("kind");
	Если КлючKind <> "agent_preset" Тогда
		Если КлючKind = Неопределено Тогда
			Возврат "invalid_json";
		КонецЕсли;
		Возврат "wrong_kind";
	КонецЕсли;

	// Проверяем версию (поддерживаемая версия = 1)
	Версия = Данные.Получить("ar_preset_version");
	Если ТипЗнч(Версия) <> Тип("Число") Тогда
		Возврат "invalid_json";
	КонецЕсли;

	Если Версия > 1 Тогда
		Возврат "unsupported_version";
	КонецЕсли;

	// Проверяем блок agent
	БлокAgent = Данные.Получить("agent");
	Если ТипЗнч(БлокAgent) <> Тип("Соответствие") Тогда
		Возврат "invalid_json";
	КонецЕсли;

	// SEC-TOOL-01: явный guard против импорта code-тулов через пресет.
	// ЗАПРЕЩЕНО: любой будущий импорт tools обязан отклонять непустой
	// ar_КодРеализации; режим «Код» принимается только через ручной ввод в
	// карточке ar_Инструменты администратором с полными правами - см. SEC-TOOL-01,
	// .docs/Модель-угроз-режим-Код.md. Прямого импорта элементов ar_Инструменты из
	// внешнего JSON сейчас не существует (пресет ссылается на tools по имени,
	// не создаёт и не переносит ar_КодРеализации) - эта проверка закрывает
	// единственную существующую точку расширения ДО появления реального
	// импортёра, а не разблокирует функциональность, которой нет.
	Если ar_ПресетСодержитЗапрещенныйКодИнструмента(БлокAgent) Тогда
		Возврат "tool_code_import_forbidden";
	КонецЕсли;

	Возврат "";

КонецФункции

// SEC-TOOL-01: проверяет, не описывает ли блок agent.tools[] пресета код
// реализации tool. Ключ "code_implementation" зарезервирован как ЗАПРЕЩЁННЫЙ
// в формате пресета - его присутствие с непустым значением у любого элемента
// tools[] является жёстким отказом (не предупреждением), независимо от того,
// существует ли сегодня реальный механизм переноса этого значения в
// ar_КодРеализации. Это превентивный контракт-guard, а не рабочая ветка
// импорта кода - см. .docs/specs/SEC-TOOL-01.md, раздел "Импорт tools -
// фактическое состояние".
//
// Параметры:
//   БлокAgent - Соответствие - блок "agent" из разобранного JSON пресета.
//
// Возвращаемое значение:
//   Булево - Истина, если хотя бы один элемент tools[] содержит непустой
//            "code_implementation".
//
Функция ar_ПресетСодержитЗапрещенныйКодИнструмента(Знач БлокAgent)

	МассивToolsJSON = БлокAgent.Получить("tools");
	Если ТипЗнч(МассивToolsJSON) <> Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого ЭлементJSON Из МассивToolsJSON Цикл
		Если ТипЗнч(ЭлементJSON) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		КодРеализацииИзПресета = ЭлементJSON.Получить("code_implementation");
		Если ТипЗнч(КодРеализацииИзПресета) = Тип("Строка") И Не ПустаяСтрока(КодРеализацииИзПресета) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Заполняет реквизиты нового агента данными из блока "agent" пресета.
//
// Параметры:
//   НовыйАгент  - СправочникОбъект.ar_Агенты - создаваемый агент.
//   БлокАгента  - Соответствие - JSON-блок "agent".
//   ИмяFallback - Строка - имя агента, если в JSON нет agent.name.
//   Результат   - Структура - накапливает НеНайденные* и НеНайденПровайдер.
//   СсылкаПровайдераОверрайд - СправочникСсылка.ar_LLMПровайдеры - если
//     заполнена, имеет приоритет над llm_provider_name пресета; модель
//     берётся из ar_DefaultModel этого провайдера вместо "model" пресета.
//
Процедура ЗаполнитьАгентаИзПресета(НовыйАгент, Знач БлокАгента, Знач ИмяFallback, Результат,
	Знач СсылкаПровайдераОверрайд = Неопределено)

	// Наименование (fallback: имя пресета/макета => имя по умолчанию)
	ИмяИзПресета = ПолучитьСтрокуJSON(БлокАгента, "name");
	Если ПустаяСтрока(ИмяИзПресета) Тогда
		ИмяИзПресета = ИмяFallback;
	КонецЕсли;
	Если ПустаяСтрока(ИмяИзПресета) Тогда
		ИмяИзПресета = НСтр("ru = 'Агент из пресета'; en = 'Agent from preset'");
	КонецЕсли;
	НовыйАгент.Наименование = ИмяСуффиксПриДубликате(ИмяИзПресета);

	// Инструкция
	НовыйАгент.ar_Инструкция = ПолучитьСтрокуJSON(БлокАгента, "instruction");

	// LLM-провайдер (нормализованный поиск без учёта регистра). Если вызывающий
	// передал СсылкаПровайдераОверрайд (мастер настройки, шаг 3) - он побеждает
	// безусловно: агент должен работать на том, что пользователь реально
	// настроил, а не на llm_provider_name, зашитом в конкретном пресете
	// (иначе модель пресета может не существовать у выбранного провайдера -
	// см. project_agent_model_not_loaded_400).
	ИмяПровайдера = ПолучитьСтрокуJSON(БлокАгента, "llm_provider_name");
	Результат.ИмяПровайдераПресет = ИмяПровайдера;

	Если ЗначениеЗаполнено(СсылкаПровайдераОверрайд) Тогда

		НовыйАгент.ar_LLMПровайдер = СсылкаПровайдераОверрайд;

		// Модель провайдера может быть не заполнена (LocalCompatible: "имя модели
		// зависит от конкретного сервера, осмысленное умолчание подставить нельзя",
		// см. ar_МастерНастройки.МодельПоУмолчаниюДляТипа) - в этом случае пустая
		// строка стёрла бы известную рабочую модель пресета без замены. Модель
		// пресета - разумный fallback: не факт, что подойдёт новому провайдеру,
		// но лучше, чем гарантированно пустая (диспетчер LLM тогда шлёт запрос
		// вовсе без имени модели - см. project_agent_model_not_loaded_400).
		МодельПровайдера = СокрЛП(СсылкаПровайдераОверрайд.ar_DefaultModel);
		НовыйАгент.ar_Модель = ?(НЕ ПустаяСтрока(МодельПровайдера),
			МодельПровайдера, ПолучитьСтрокуJSON(БлокАгента, "model"));

	Иначе

		Если НЕ ПустаяСтрока(ИмяПровайдера) Тогда
			СсылкаПровайдера = НайтиПровайдераПоИмени(ИмяПровайдера);
			Если СсылкаПровайдера = Неопределено Тогда
				Результат.НеНайденПровайдер = Истина;
			Иначе
				НовыйАгент.ar_LLMПровайдер = СсылкаПровайдера;
			КонецЕсли;
		КонецЕсли;

		НовыйАгент.ar_Модель = ПолучитьСтрокуJSON(БлокАгента, "model");

	КонецЕсли;

	// Температура, лимиты
	НовыйАгент.ar_Температура       = ПолучитьЧислоJSON(БлокАгента, "temperature");
	НовыйАгент.ar_МаксШагов         = ПолучитьЦелоеЧислоJSON(БлокАгента, "max_steps");
	НовыйАгент.ar_МаксДействий      = ПолучитьЦелоеЧислоJSON(БлокАгента, "max_actions");
	НовыйАгент.ar_МаксСуммаДействия = ПолучитьЧислоJSON(БлокАгента, "max_action_sum");

	// Режим автономии (поиск значения перечисления по строковому имени через метаданные)
	ИмяРежима = ПолучитьСтрокуJSON(БлокАгента, "autonomy_mode");
	Если НЕ ПустаяСтрока(ИмяРежима) Тогда
		МетаЗначенияРежима = Метаданные.Перечисления.ar_РежимАвтономии.ЗначенияПеречисления;
		МетаЗначениеРежима = МетаЗначенияРежима.Найти(ИмяРежима);
		Если МетаЗначениеРежима <> Неопределено Тогда
			НовыйАгент.ar_РежимАвтономии = Перечисления.ar_РежимАвтономии[ИмяРежима];
		КонецЕсли;
	КонецЕсли;

	// Новый агент всегда создаётся неактивным
	НовыйАгент.ar_Активен = Ложь;

	// ТЧ ar_ДоступныеИнструменты
	ЗаполнитьTools(НовыйАгент, БлокАгента.Получить("tools"), Результат);

	// ТЧ ar_ПодключённыеSkills (условно - если META-24 реализована)
	ЗаполнитьSkills(НовыйАгент, БлокАгента.Получить("skills"), Результат);

КонецПроцедуры

// Заполняет ТЧ ar_ДоступныеИнструменты из массива tools пресета.
//
// Параметры:
//   НовыйАгент      - СправочникОбъект.ar_Агенты
//   МассивToolsJSON - Массив или Неопределено
//   Результат       - Структура - накапливает НеНайденныеTools и
//                      НеНайденыОбязательныеTools (подмножество с required=true)
//
Процедура ЗаполнитьTools(НовыйАгент, Знач МассивToolsJSON, Результат)

	Если ТипЗнч(МассивToolsJSON) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	// Собираем все запрошенные имена
	ИменаTools = Новый Массив;
	ВключенностьПоИмени = Новый Соответствие;
	ОбязательностьПоИмени = Новый Соответствие;
	Для Каждого ЭлементJSON Из МассивToolsJSON Цикл
		Если ТипЗнч(ЭлементJSON) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		ИмяTool = ПолучитьСтрокуСоответствия(ЭлементJSON, "name");
		Если ПустаяСтрока(ИмяTool) Тогда
			Продолжить;
		КонецЕсли;
		ИменаTools.Добавить(ИмяTool);
		ВключенностьПоИмени.Вставить(ИмяTool, (ЭлементJSON.Получить("enabled") = Истина));
		ОбязательностьПоИмени.Вставить(ИмяTool, (ЭлементJSON.Получить("required") = Истина));
	КонецЦикла;

	Если ИменаTools.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// Пакетный запрос: ищем все tools сразу
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка,
	|	т.ar_Имя КАК Имя
	|ИЗ
	|	Справочник.ar_Инструменты КАК т
	|ГДЕ
	|	т.ar_Имя В (&Имена)
	|	И т.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Имена", ИменаTools);
	НайденныеTools = Запрос.Выполнить().Выбрать();

	НайденныеПоИмени = Новый Соответствие;
	Пока НайденныеTools.Следующий() Цикл
		НайденныеПоИмени.Вставить(НайденныеTools.Имя, НайденныеTools.Ссылка);
	КонецЦикла;

	// PKG-05 §6: namespace всех известных реестру пакетов (в любом статусе) -
	// для отличия "имя похоже на tool известного, но сейчас неактивного пакета"
	// (диагностируемый отказ package_not_installed:<ns>) от "tool вообще не
	// относится ни к одному пакету, просто не найден" (обычный код ошибки).
	// Запрашивается один раз на весь вызов - ВсеИзвестныеNamespace() не
	// зависит от ИменаTools.
	ИзвестныеNamespace = ar_ИнструментыПакеты.ВсеИзвестныеNamespace();

	НовыйАгент.ar_ДоступныеИнструменты.Очистить();
	Для Каждого ИмяTool Из ИменаTools Цикл
		СсылкаTool = НайденныеПоИмени.Получить(ИмяTool);
		Если СсылкаTool = Неопределено Тогда
			ЗафиксироватьНенайденныйTool(ИмяTool, ИзвестныеNamespace,
				ОбязательностьПоИмени.Получить(ИмяTool) = Истина, Результат);
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НовыйАгент.ar_ДоступныеИнструменты.Добавить();
		// ar_Инструмент - строковое имя tool (ar_Имя), не ссылка: тип реквизита ТЧ -
		// Строка(150), и форма карточки агента работает с ним как с именем.
		// Присваивание ссылки молча приводилось к её представлению, из-за чего
		// соединение с реестром ar_Инструменты не находило ни одной строки - агент
		// оставался без инструментов.
		НоваяСтрока.ar_Инструмент = ИмяTool;
		НоваяСтрока.ar_Включен = ВключенностьПоИмени.Получить(ИмяTool);
	КонецЦикла;

КонецПроцедуры

// Фиксирует ненайденный в ar_Инструменты элемент tools[] пресета в Результате -
// вынесено из ЗаполнитьTools отдельной функцией, чтобы снизить когнитивную
// сложность цикла (PKG-05 §6 добавил ветвление package_not_installed:<ns>
// поверх уже существовавшей логики НеНайденныеTools/НеНайденыОбязательныеTools).
//
// Параметры:
//   ИмяTool            - Строка - имя tool из пресета, не найденное в ar_Инструменты.
//   ИзвестныеNamespace - Соответствие - результат ar_ИнструментыПакеты.ВсеИзвестныеNamespace().
//   Обязателен         - Булево - required=true у этого элемента tools[] пресета.
//   Результат          - Структура - накапливает НеНайденныеTools/НеНайденыОбязательныеTools.
//
Процедура ЗафиксироватьНенайденныйTool(Знач ИмяTool, Знач ИзвестныеNamespace, Знач Обязателен, Результат)

	КодОтсутствияПакета = КодНеустановленногоПакета(ИмяTool, ИзвестныеNamespace);
	// Диагностируемый отказ package_not_installed:<ns> вместо немого попадания
	// в общий список "не найдено" - имя однозначно относится к известному
	// реестру пакету, который сейчас не активен (не установлен/отключён).
	КодДляРезультата = ?(ПустаяСтрока(КодОтсутствияПакета), ИмяTool, КодОтсутствияПакета);

	Результат.НеНайденныеTools.Добавить(КодДляРезультата);
	Если Обязателен Тогда
		Результат.НеНайденыОбязательныеTools.Добавить(КодДляРезультата);
	КонецЕсли;

КонецПроцедуры

// PKG-05 §6: определяет, относится ли ненайденное имя tool к ИЗВЕСТНОМУ
// реестру пакету, который сейчас не активен (не установлен/отключён/отклонён).
// Namespace пакета в пресете явно не указывается (контракт пресета оперирует
// только именем tool), поэтому имя сопоставляется с известными namespace по
// правилу "начинается с <namespace>_" - при нескольких совпадающих namespace
// (namespace сам может содержать "_") выбирается САМЫЙ ДЛИННЫЙ, как наиболее
// специфичное совпадение.
//
// Параметры:
//   ИмяTool            - Строка - имя tool из пресета, не найденное в ar_Инструменты.
//   ИзвестныеNamespace - Соответствие - результат ar_ИнструментыПакеты.ВсеИзвестныеNamespace()
//                        (Namespace -> Активен).
//
// Возвращаемое значение:
//   Строка - "package_not_installed:<ns>", если имя относится к известному,
//   но неактивному namespace; "" - если совпадений нет (обычный "tool не
//   найден") либо namespace активен (несостыковка не по вине пакета -
//   диагностика PKG-05 её не покрывает, tool остаётся в общем списке).
//
Функция КодНеустановленногоПакета(Знач ИмяTool, Знач ИзвестныеNamespace)

	ЛучшийNamespace = "";
	ЛучшаяАктивность = Неопределено;

	Для Каждого Элемент Из ИзвестныеNamespace Цикл
		Namespace = Элемент.Ключ;
		Префикс = Namespace + "_";
		Если Лев(ИмяTool, СтрДлина(Префикс)) = Префикс
			И СтрДлина(Namespace) > СтрДлина(ЛучшийNamespace) Тогда
			ЛучшийNamespace = Namespace;
			ЛучшаяАктивность = Элемент.Значение;
		КонецЕсли;
	КонецЦикла;

	Если ПустаяСтрока(ЛучшийNamespace) Тогда
		Возврат "";
	КонецЕсли;

	Если ЛучшаяАктивность = Истина Тогда
		// Namespace активен, но конкретный tool всё равно не найден в ar_Инструменты -
		// это не "пакет не установлен" (диагностика PKG-05 не про этот случай),
		// оставляем обычным tool_not_found.
		Возврат "";
	КонецЕсли;

	Возврат "package_not_installed:" + ЛучшийNamespace;

КонецФункции

// Заполняет ТЧ ar_ПодключённыеSkills, если ТЧ существует в метаданных.
// Защита от ситуации когда META-24 ещё не реализована.
//
// Параметры:
//   НовыйАгент       - СправочникОбъект.ar_Агенты
//   МассивSkillsJSON - Массив или Неопределено
//   Результат        - Структура - накапливает НеНайденныеSkills
//
Процедура ЗаполнитьSkills(НовыйАгент, Знач МассивSkillsJSON, Результат)

	// Проверяем наличие ТЧ (META-24 может быть не реализована)
	Если Метаданные.Справочники.ar_Агенты.ТабличныеЧасти.Найти("ar_ПодключённыеSkills") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(МассивSkillsJSON) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	// Собираем имена skills
	ИменаSkills = Новый Массив;
	Для Каждого ЭлементJSON Из МассивSkillsJSON Цикл
		Если ТипЗнч(ЭлементJSON) <> Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		ИмяSkill = ПолучитьСтрокуСоответствия(ЭлементJSON, "name");
		Если НЕ ПустаяСтрока(ИмяSkill) Тогда
			ИменаSkills.Добавить(ИмяSkill);
		КонецЕсли;
	КонецЦикла;

	Если ИменаSkills.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// Пакетный запрос skills по наименованию
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	с.Ссылка КАК Ссылка,
	|	с.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ar_Навыки КАК с
	|ГДЕ
	|	с.Наименование В (&Имена)
	|	И с.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Имена", ИменаSkills);
	НайденныеSkills = Запрос.Выполнить().Выбрать();

	НайденныеПоИмени = Новый Соответствие;
	Пока НайденныеSkills.Следующий() Цикл
		НайденныеПоИмени.Вставить(НайденныеSkills.Наименование, НайденныеSkills.Ссылка);
	КонецЦикла;

	НовыйАгент.ar_ПодключённыеSkills.Очистить();
	Для Каждого ИмяSkill Из ИменаSkills Цикл
		СсылкаSkill = НайденныеПоИмени.Получить(ИмяSkill);
		Если СсылкаSkill = Неопределено Тогда
			Результат.НеНайденныеSkills.Добавить(ИмяSkill);
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НовыйАгент.ar_ПодключённыеSkills.Добавить();
		НоваяСтрока.ar_Skill   = СсылкаSkill;
		НоваяСтрока.ar_Включен = Истина;
	КонецЦикла;

КонецПроцедуры

// Ищет LLM-провайдера по имени (нормализованное сравнение без учёта регистра).
//
// Параметры:
//   ИмяПровайдера - Строка
//
// Возвращаемое значение:
//   СправочникСсылка.ar_LLMПровайдеры или Неопределено.
//
Функция НайтиПровайдераПоИмени(Знач ИмяПровайдера)

	// Сравнение строк в языке запросов регистронезависимо по умолчанию (в
	// отличие от BSL-кода) - отдельная функция приведения регистра не нужна.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	п.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ar_LLMПровайдеры КАК п
	|ГДЕ
	|	п.ПометкаУдаления = ЛОЖЬ
	|	И п.Наименование = &Наименование";

	Запрос.УстановитьПараметр("Наименование", ИмяПровайдера);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Формирует имя агента с суффиксом даты если агент с таким именем уже есть.
//
// Параметры:
//   ИсходноеИмя - Строка - желаемое наименование
//
// Возвращаемое значение:
//   Строка - итоговое наименование.
//
Функция ИмяСуффиксПриДубликате(Знач ИсходноеИмя)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	а.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ar_Агенты КАК а
	|ГДЕ
	|	а.Наименование = &Наименование
	|	И а.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Наименование", ИсходноеИмя);

	Если Запрос.Выполнить().Пустой() Тогда
		Возврат ИсходноеИмя;
	КонецЕсли;

	// Добавляем суффикс с датой
	СуффиксДаты = Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMdd");
	Возврат ИсходноеИмя
		+ НСтр("ru = ' (из пресета '; en = ' (from preset '")
		+ СуффиксДаты + ")";

КонецФункции

// Безопасно извлекает строковое значение из Соответствия по ключу.
//
// Параметры:
//   Соответствие - Соответствие - JSON-объект
//   Ключ         - Строка
//
// Возвращаемое значение:
//   Строка
//
Функция ПолучитьСтрокуСоответствия(Знач Соответствие, Знач Ключ)

	Значение = Соответствие.Получить(Ключ);
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат "";

КонецФункции

// Безопасно извлекает строковое значение из JSON-соответствия по ключу.
//
// Параметры:
//   БлокJSON - Соответствие
//   Ключ     - Строка
//
// Возвращаемое значение:
//   Строка
//
Функция ПолучитьСтрокуJSON(Знач БлокJSON, Знач Ключ)

	Если ТипЗнч(БлокJSON) <> Тип("Соответствие") Тогда
		Возврат "";
	КонецЕсли;

	Возврат ПолучитьСтрокуСоответствия(БлокJSON, Ключ);

КонецФункции

// Безопасно извлекает числовое значение из JSON-соответствия по ключу.
//
// Параметры:
//   БлокJSON - Соответствие
//   Ключ     - Строка
//
// Возвращаемое значение:
//   Число
//
Функция ПолучитьЧислоJSON(Знач БлокJSON, Знач Ключ)

	Если ТипЗнч(БлокJSON) <> Тип("Соответствие") Тогда
		Возврат 0;
	КонецЕсли;

	Значение = БлокJSON.Получить(Ключ);
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат 0;

КонецФункции

// Безопасно извлекает целочисленное значение из JSON-соответствия по ключу.
//
// Параметры:
//   БлокJSON - Соответствие
//   Ключ     - Строка
//
// Возвращаемое значение:
//   Число (целое)
//
Функция ПолучитьЦелоеЧислоJSON(Знач БлокJSON, Знач Ключ)

	Возврат Цел(ПолучитьЧислоJSON(БлокJSON, Ключ));

КонецФункции

// Записывает ошибку в журнал регистрации.
//
// Параметры:
//   ИнфОбОшибке - ИнформацияОбОшибке
//
Процедура ЗаписатьОшибкуВЖурнал(Знач ИнфОбОшибке)

	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'AgentRunner.ИмпортПресета'; en = 'AgentRunner.PresetImport'"),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Справочники.ar_Пресеты,
		,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфОбОшибке));

КонецПроцедуры

#КонецОбласти
